Revit 2027 API
BuiltInFailures.TagByExampleFailures Class
 Failures about Tag by Example.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.TagByExampleFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class TagByExampleFailures
Public NotInheritable Class TagByExampleFailures
public ref class TagByExampleFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TagByExampleFailures = class end
The BuiltInFailures.TagByExampleFailures type exposes the following members.
Properties
Name | Description
CannotCreateTag |  The tag couldn't be created.
CannotCreateTagRotationWarning |  Tag by Example couldn't tag the host as it is not parallel to the example host.
CannotCreateTagWarning |  Tag by Example couldn't tag the host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace